IDEA Open Model
CutData Class
Compatible with IDEA StatiCa 20.1
 Provides data of the cut beam
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Connection.CutData
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class CutData
Public Class CutData
The CutData type exposes the following members.
Constructors
Name | Description
CutData
Initializes a new instance of the CutData class
Top
Properties
Name | Description
NormalVector
 Plane normal
PlanePoint
 3DPlane Point
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace